dms/events/initSiteConfig.php

SELECT `store_range` FROM `system` WHERE `code`='smtp_charset'
---
    public static function assign() {

        $cache = Yii::$app->cache;
        $smtp = $cache->get('system_smtp');
        if ($smtp === false) {
            $smtp = System::getChildrenValue('smtp');
            $range = System::find()->where(['code' => 'smtp_charset'])->select('store_range')->one();