dms/models/Major.php

SELECT * FROM `college` ORDER BY `sort_order`
---
    public static function get_college_id() {
        $college = College::find()->orderBy('sort_order')->all();