dms/models/PasswordResetRequestForm.php

    public function sendEmail() {
        /* @var $user User */
        $user = User::findOne([
                    'status' => User::STATUS_ACTIVE,
                    'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!User::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {
---
SELECT * FROM `user` WHERE (`status`=10) AND (`email`='179611207@qq.com')
UPDATE `user` SET `password_reset_token`='TXRPiw-MGty-ogXEwLhq-e_Fv-e-2nMj_1484645379', `updated_at`=1484645379 WHERE `id`=1