dms/models/System.php

SELECT `id` FROM `system` WHERE `code`='captcha'
SELECT * FROM `system` WHERE `parent_id`=3 ORDER BY `sort_order`
---
    public static function getChildren($code = '') {
        $parent = static::find()->where(['code' => $code])->select('id')->one();
        return static::find()->where(['parent_id' => $parent['id']])->orderBy('sort_order ASC')->all();

SELECT `id` FROM `system` WHERE `code`='smtp'
SELECT * FROM `system` WHERE `parent_id`=2 ORDER BY `sort_order`
---
    public static function getChildrenValue($code = '') {
        $parent = static::find()->where(['code' => $code])->select('id')->one();
        $infos = static::find()->where(['parent_id' => $parent['id']])->orderBy('sort_order ASC')->all();

SELECT * FROM `system` WHERE `code`='smtp_service'
---
    public static function getValue($code = '') {
        $config = static::findOne(['code' => $code]);

SELECT * FROM `system` WHERE `code`='captcha_open'
UPDATE `system` SET `value`='2' WHERE `id`=301
---
    public static function setValue($code = '', $value = '') {
        $config = static::findOne(['code' => $code]);
        if ($value != $config['value']) {
            $config['value'] = $value;
            return $config->save();

SELECT * FROM `system` WHERE (`code`='captcha_open') AND (FIND_IN_SET('2', value))
---
    public static function existValue($code = '', $value = '') {
        return static::find()->where(['code' => $code])->andWhere('FIND_IN_SET(:value, value)')->addParams([':value' => $value])->one();